cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mdogan/zulu"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "stripe/stripe-cli"
tap "wix/brew"

brew "automake"
brew "azure-cli"
brew "bison"
brew "eza"
brew "libyaml"
brew "ruby"
brew "fastlane"
brew "gdbm"
brew "gh"
brew "git-lfs"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gradle"
brew "kotlin"
brew "kubeseal"
brew "kustomize"
brew "latexindent"
brew "lazygit"
brew "libffi"
brew "luarocks"
brew "maclaunch"
brew "mas"
brew "maven"
brew "mkcert"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "pnpm"
brew "pre-commit"
brew "ruby-build"
brew "rbenv"
brew "ruff"
brew "sbt"
brew "starship"
brew "stow"
brew "watchman"
brew "zsh-syntax-highlighting"
brew "wix/brew/applesimutils"

cask "1password-cli"
cask "keepassxc"
cask "mactex-no-gui"
cask "meld"
cask "miniconda"
cask "zulu-jdk11"
cask "zulu-jdk17"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835

vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.file-nesting"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fivem-vscode.fivem-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "naco-siren.gradle-language"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "sonarsource.sonarlint-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
