tap "ariga/tap"
tap "goreleaser/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "majd/repo"
tap "mdogan/zulu"
tap "mununki/tools"
tap "oven-sh/bun"
tap "withgraphite/tap"
brew "act"
brew "automake"
brew "libyaml"
brew "cocoapods"
brew "eza"
brew "fnm"
brew "gdbm"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "harfbuzz"
brew "icu4c@76"
brew "gradle"
brew "graphviz"
brew "kubeseal"
brew "kustomize"
brew "maclaunch"
brew "mas"
brew "neovim"
brew "openstackclient"
brew "pandoc"
brew "pnpm"
brew "pstree"
brew "sherlock"
brew "starship"
brew "stow"
brew "yarn"
brew "zizmor"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
brew "withgraphite/tap/graphite"
cask "adobe-creative-cloud"
cask "android-studio"
cask "basictex"
cask "bruno", args: { appdir: "/Applications" }
cask "chatgpt"
cask "citrix-workspace", args: { appdir: "/Applications" }
cask "datagrip"
cask "discord", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "fontforge"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2", args: { appdir: "/Applications" }
cask "keepassxc"
cask "macupdater", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "miniconda"
cask "monitorcontrol", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "obsidian"
cask "orbstack"
cask "sf-symbols", args: { appdir: "/Applications" }
cask "sirimote", args: { appdir: "/Applications" }
cask "slack"
cask "unity"
cask "unity-hub"
cask "zotero"
cask "zulu-jdk21"
mas "AdGuard for Safari", id: 1440147259
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "antfu.file-nesting"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "jetpack-io.devbox"
vscode "jock.svg"
vscode "meta.relay"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "sonarsource.sonarlint-vscode"
vscode "swmansion.react-native-ide"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
